Repository: delboy1978uk/boneframework
Catalog: data/translations/*/*.po
Languages: fr_be

source: About
fr_be: Sur

# download
source: Loot
fr_be: Télécharger

source: Contribute
fr_be: Contribuer

# learn
source: Learn Bone MVC Framework
fr_be: Apprendre Bone MVC Framework

# language
source: Lingo
fr_be: La langue

# home.intro
source: It be yet another PHP framework swashbucklin' ont' th' scene!
fr_be: Un framework PHP pour les pirates

# index.intro
source: Be ye wantin an MVC framework peppered with local pirate lingo? It be the most bare bones framework in the seven seas! Garr!
fr_be: Un framework PHP pour les pirates

# index.install
source: Ye can download th' Bone MVC source code by sailin' over t' Github. But the Cap'n recommends ye install
fr_be: You can download the Bone MVC source code by browsing over to Github. But we recommend you install

# index.install2
source: 'n' do it that way.
fr_be: et le faire de cette façon.

source: Visit
fr_be: Visite

# index.crew
source: Gaarrrr! We be needin' a foul-mouthed grog swillin' crew
fr_be: Nous sommes toujours à la recherche de contributeurs

# index.crew2
source: t' sail th' ship t' th' fabled Monkey Island.
fr_be: pour aider Bone MVC à être encore meilleur.

# index.crew3
source: If ye like Bone an' want t' help conquer the seven seas, fork it and get aboard!
fr_be: Si vous aimez Bone et souhaitez contribuer à son développement, rejoignez-le!

# learn.learn
source: Learn Bone MVC Framework
fr_be: Apprendre Bone Framework MVC

# learn.tagline
source: All our crew be trained by the Melee Island Swordmaster!
fr_be: Il est facile de se lancer avec un nouveau projet

# learn.composer
source: Ahoy matey! First ye be needin'
fr_be: D'abord, assurez-vous d'avoir

# learn.install.bone
source: Then install Bone.
fr_be: Ensuite, installez Bone.

# learn.globally
source: or if ye haven't installed composer globally ...
fr_be: ou si vous n'avez pas installé le compositeur globalement ...

source: Docker Dev Box
fr_be: Docker boîte de développement

# docker.about
source: Bone comes wit' a docker-compose.yml in th' project, so ye can instantly get a dev server runnin' if ye use Docker (Tested usin' a default VirtualBox VM). Jus' add this t' yer hosts file
fr_be: Bone est livré avec un fichier docker-compose.yml dans le projet. Vous pouvez donc instantanément lancer un serveur de développement si vous utilisez Docker (testé à l'aide d'une machine virtuelle VirtualBox par défaut). Ajoutez simplement ceci à votre fichier hosts

# docker.browse
source: Then ye can access th' site at https://awesome.scot in yer browser. O' course if ye don't use docker ye can add it t' yer LAMP stack in th' usual way.
fr_be: Ensuite, vous pouvez accéder au site à l'adresse https://awesome.scot dans votre navigateur. Bien sûr, si vous n'utilisez pas docker, vous pouvez l'ajouter à votre pile LAMP de la manière habituelle.

# configure
source: Cap'n's Logs
fr_be: Configurer

# learn.folders
source: Ye can see ye have a config, data, public, and src folder. Dinnae be touchin' th' vendor folder or th' Cap'n will make ye walk the plank!
fr_be: Vous pouvez voir un dossier config, data, public et src. Conserver le dossier du fournisseur, c’est là que composeur installe les dépendances du projet.

# learn.777
source: Make th' data folder writable. 777 be lettin' every landlubber have write access, so if ye can we prefer 775 with yer Apache user in th' group.
fr_be: Rendez le dossier de données accessible en écriture. 777 donne à tout le monde un accès en écriture, donc définissez-le à 775 avec votre utilisateur Apache du groupe.

# learn.vhosts
source: In yer apache virtual hosts, set the document root as th' public folder
fr_be: Dans vos hôtes virtuels Apache, définissez la racine du document en tant que dossier public.

# learn.config
source: Th' config folder
fr_be: Le dossier de configuration

# learn.config.drop
source: Ye can drop in any number o' <span class="label label-success">.php</span> files into th' <span class="label label-success">config/</span> folder. Make sure they return an array wit' th' config . Ye can o'erride configuration based on environment var <span class="label label-success">APPLICATION_ENV</span>, so fer instance if th' environment was productionit would load th' additional config th' production subdirectory.</p><p>Thar are several config files by default:
fr_be: Vous pouvez déposer n'importe quel nombre de fichiers <span class = "label label-success">.php</span> dans la <span class="label label-success">config/</span>. Assurez-vous qu'ils renvoient un tableau avec la configuration. Vous pouvez remplacer la configuration en fonction de l'environnement var <span class="label label-success">APPLICATION_ENV</span>, par exemple si l'environnement était en production il chargerait la configuration supplémentaire du sous-répertoire de production.</ p><p> Il existe plusieurs fichiers de configuration par défaut:

# learn.config.registry
source: In yer config files, ye can add anythin' ye wants. It gets stored in th' Bone\Mvc\Registry.
fr_be: Dans vos fichiers de configuration, vous pouvez ajouter ce que vous voulez. Il est stocké dans le registre Bone\Mvc\Registry.

source: Database
fr_be: Base de données

# learn.db
source: Set yer default db credentials in th' main config/db.php, 'n any environment specific configs in a subdirectory
fr_be: Définissez vos informations d'identification de base de données par défaut dans le fichier config / db.php principal, ainsi que toute configuration spécifique à l'environnement dans un sous-répertoire.

# i18n
source: Lingo
fr_be: Internationalisation

# learn.i18n.about
source: Bone supports translation into different locales. Translation files (gettext .po 'n .mo) best be placed in data/translations, under a subdirectory o' th' locale, eg data/translations/en_GB/en_GB.po. Ye can set th' default locale 'n an array o' supported locales.
fr_be: Bone prend en charge la traduction dans différents lieux. Les fichiers de traduction (gettext .po et .mo) doivent être placés dans data / translations, dans un sous-répertoire de la langue, par exemple data / translations / en_GB / en_GB.po. Vous pouvez définir les paramètres régionaux par défaut et un tableau des paramètres régionaux pris en charge.

# learn.i18n.usage
source: T' use th' translator, ye can simply call:
fr_be: Pour utiliser le traducteur, vous pouvez simplement appeler:

# logs
source: Cap'n's Logs
fr_be: Les journaux

# learn.logs
source: Bone uses monolog/monolog, 'n logs can be found in <span crew="label label-success">data/logs</span>. Currently we only support writin' t' files, but ye can add as many channels as ye like:
fr_be: Bone utilise monolog/monolog. On peut trouver n logs dans <span crew="label label-success">data/logs</ span>. Actuellement, nous ne prenons en charge que les fichiers en écriture, mais vous pouvez ajouter autant de canaux que vous aimez:

# learn.logs.usage
source: T' use th' logger in a controller:
fr_be: Bone utilise Zend Mail. Pour configurer le client de messagerie, il suffit de déposer votre configuration (voir zend mail docs)

# mail
source: Messages in bottles
fr_be: Courrier

# learn.mail
source: Bone uses Zend Mail. T' configure th' mail client, jus' drop in yer config (see zend mail docs)
fr_be: Bone utilise Zend Mail. Pour configurer le client de messagerie, il suffit de déposer votre configuration (voir zend mail docs)

# learn.mail.hog
source: If ye be usin' th' Docker Box provided by bone, ye also 'ave th' awesome MailHog at yer disposal. Browse t' awesome.scot:8025 'n ye'll see a catch all email inbox, so ye ne'er needs t' worry about development emails reachin' th' real world.
fr_be: Si vous utilisez la boîte Docker fournie par bone, vous avez également le formidable MailHog à votre disposition. Naviguez vers awesome.scot:8025 et vous verrez apparaître une boîte de réception électronique complète, de sorte que vous n’aurez jamais à vous soucier des courriels de développement atteignant le monde réel.

# routes
source: Voyages
fr_be: Routes

# learn.routes
source: Routes follow a default pattern o' /controller/action/param/value/nextparam/nextvalue/etc/etc<br>Ye can also o'erride routes by definin' them in th' config array:
fr_be: Les itinéraires suivent un modèle par défaut de /controller/action/param/value/nextparam/nextvalue/etc/etc<br> Vous pouvez également remplacer les itinéraires en les définissant dans le tableau de configuration:

# learn.routes.params
source: When definin' routes, mandatory variables in th' uri 'ave a colon like :id<br /> Optional uri vars 'ave [ ] surroundin' them like [:id]
fr_be: Lors de la définition des itinéraires, les variables obligatoires dans l'URI ont deux points comme: id <br /> Les uri vars facultatifs sont entourées par [] comme [: id]

source: Layouts
fr_be: Mises en page

# learn.layouts
source: Ignore this config. 'tis ole deprecated nonsense.
fr_be: Ignorer cette config. C'est vieux non-sens obsolète.
